QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_adc.h
#ifndef HW_ADC_H
#define HW_ADC_H

//*************************************************************************************************
//
// The following are defines for the ADC register offsets
//
//*************************************************************************************************
#define ADC_O_CTL1       0x0U  // WR    // ADC Control 1 Register
#define ADC_O_CTL2       0x4U  // WR    // ADC Control 2 Register
#define ADC_O_BURSTCTL   0x8U  // WR    // ADC Burst Control Register
#define ADC_O_INTFLG     0xcU  // R     // ADC Interrupt Flag Register
#define ADC_O_INTFLGCLR  0x10U // WR    // ADC Interrupt Flag Clear Register
#define ADC_O_INTOVF     0x14U // R     // ADC Interrupt Overflow Register
#define ADC_O_INTOVFCLR  0x18U // WR    // ADC Interrupt Overflow Clear Registerv
#define ADC_O_INTSEL1N2  0x1cU // WR    // ADC Interrupt 1 and 2 Selection Register
#define ADC_O_INTSEL3N4  0x20U // WR    // ADC Interrupt 3 and 4 Selection Register
#define ADC_O_SOCPRICTL  0x24U // WR    // ADC SOC Priority Control Register
#define ADC_O_INTSOCSEL1 0x28U // WR    // ADC Interrupt SOC Selection 1 Register
#define ADC_O_INTSOCSEL2 0x2cU // WR    // ADC Interrupt SOC Selection 2 Register
#define ADC_O_SOCFLG1    0x30U // R     // ADC SOC Flag 1 Register
#define ADC_O_SOCFRC1    0x34U // RW1S  // ADC SOC Force 1 Register
#define ADC_O_SOCOVF1    0x38U // R     // ADC SOC Overflow 1 Register
#define ADC_O_SOCOVFCLR1 0x3cU // RW1S  // ADC SOC Overflow Clear 1 Register
#define ADC_O_SOC0CTL    0x40U // WR    // ADC SOC0 Control Register
#define ADC_O_SOC1CTL    0x44U // WR    // ADC SOC1 Control Register
#define ADC_O_SOC2CTL    0x48U // WR    // ADC SOC2 Control Register
#define ADC_O_SOC3CTL    0x4cU // WR    // ADC SOC3 Control Register
#define ADC_O_SOC4CTL    0x50U // WR    // ADC SOC4 Control Register
#define ADC_O_SOC5CTL    0x54U // WR    // ADC SOC5 Control Register
#define ADC_O_SOC6CTL    0x58U // WR    // ADC SOC6 Control Register
#define ADC_O_SOC7CTL    0x5cU // WR    // ADC SOC7 Control Register
#define ADC_O_SOC8CTL    0x60U // WR    // ADC SOC8 Control Register
#define ADC_O_SOC9CTL    0x64U // WR    // ADC SOC9 Control Register
#define ADC_O_SOC10CTL   0x68U // WR    // ADC SOC10 Control Register
#define ADC_O_SOC11CTL   0x6cU // WR    // ADC SOC11 Control Register
#define ADC_O_SOC12CTL   0x70U // WR    // ADC SOC12 Control Register
#define ADC_O_SOC13CTL   0x74U // WR    // ADC SOC13 Control Register
#define ADC_O_SOC14CTL   0x78U // WR    // ADC SOC14 Control Register
#define ADC_O_SOC15CTL   0x7cU // WR    // ADC SOC15 Control Register
#define ADC_O_EVTSTAT    0x80U // R     // ADC Event Status Register
#define ADC_O_EVTCLR     0x84U // WR    // ADC Event Clear Register
#define ADC_O_EVTSEL     0x88U // WR    // ADC Event Selection Register
#define ADC_O_EVTINTSEL  0x8cU // WR    // ADC Event Interrupt Selection Register
// #define ADC_O_OSDETECT       0x90U  //   // ADC Open and Shorts Detect Register
#define ADC_O_COUNTER 0x94U // R    // ADC Counter Register
#define ADC_O_REV     0x98U // R    // ADC Revision Register
// #define ADC_O_OFFTRIM        0x9cU  //   // ADC Offset Trim Register
#define ADC_O_PPB1CONFIG 0xa0U  // WR   // ADC PPB1 Config Register
#define ADC_O_PPB1STAMP  0xa4U  // R    // ADC PPB1 Sample Delay Time Stamp Register
#define ADC_O_PPB1OFFCAL 0xa8U  // WR   // ADC PPB1 Offset Calibration Register
#define ADC_O_PPB1OFFREF 0xacU  // WR   // ADC PPB1 Offset Reference Register
#define ADC_O_PPB1TRIPHI 0xb0U  // WR   // ADC PPB1 Trip High Register
#define ADC_O_PPB1TRIPLO 0xb4U  // WR   // ADC PPB1 Trip Low/Trigger Time Stamp Register
#define ADC_O_PPB2CONFIG 0xb8U  // WR   // ADC PPB2 Config Register
#define ADC_O_PPB2STAMP  0xbcU  // R    // ADC PPB2 Sample Delay Time Stamp Register
#define ADC_O_PPB2OFFCAL 0xc0U  // WR   // ADC PPB2 Offset Calibration Register
#define ADC_O_PPB2OFFREF 0xc4U  // WR   // ADC PPB2 Offset Reference Register
#define ADC_O_PPB2TRIPHI 0xc8U  // WR   // ADC PPB2 Trip High Register
#define ADC_O_PPB2TRIPLO 0xccU  // WR   // ADC PPB2 Trip Low/Trigger Time Stamp Register
#define ADC_O_PPB3CONFIG 0xd0U  // WR   // ADC PPB3 Config Register
#define ADC_O_PPB3STAMP  0xd4U  // R    // ADC PPB3 Sample Delay Time Stamp Register
#define ADC_O_PPB3OFFCAL 0xd8U  // WR   // ADC PPB3 Offset Calibration Register
#define ADC_O_PPB3OFFREF 0xdcU  // WR   // ADC PPB3 Offset Reference Register
#define ADC_O_PPB3TRIPHI 0xe0U  // WR   // ADC PPB3 Trip High Register
#define ADC_O_PPB3TRIPLO 0xe4U  // WR   // ADC PPB3 Trip Low/Trigger Time Stamp Register
#define ADC_O_PPB4CONFIG 0xe8U  // WR   // ADC PPB4 Config Register
#define ADC_O_PPB4STAMP  0xecU  // R    // ADC PPB4 Sample Delay Time Stamp Register
#define ADC_O_PPB4OFFCAL 0xf0U  // WR   // ADC PPB4 Offset Calibration Register
#define ADC_O_PPB4OFFREF 0xf4U  // WR   // ADC PPB4 Offset Reference Register
#define ADC_O_PPB4TRIPHI 0xf8U  // WR   // ADC PPB4 Trip High Register
#define ADC_O_PPB4TRIPLO 0xfcU  // WR   // ADC PPB4 Trip Low/Trigger Time Stamp Register
#define ADC_O_INTCYCLE   0x100U // WR   // ADC Early Interrupt Generation Cycle
#define ADC_O_INLTRIM1   0x104U // R    // ADC Linearity Trim 1 Register
#define ADC_O_INLTRIM2   0x108U // R    // ADC Linearity Trim 2 Register

#define ADC_O_RESULT0    0x0U  // 0x0U    // ADC Result 0 Register
#define ADC_O_RESULT1    0x4U  // 0x1U    // ADC Result 1 Register
#define ADC_O_RESULT2    0x8U  // 0x2U    // ADC Result 2 Register
#define ADC_O_RESULT3    0xcU  // 0x3U    // ADC Result 3 Register
#define ADC_O_RESULT4    0x10U // 0x4U    // ADC Result 4 Register
#define ADC_O_RESULT5    0x14U // 0x5U    // ADC Result 5 Register
#define ADC_O_RESULT6    0x18U // 0x6U    // ADC Result 6 Register
#define ADC_O_RESULT7    0x1cU // 0x7U    // ADC Result 7 Register
#define ADC_O_RESULT8    0x20U // 0x8U    // ADC Result 8 Register
#define ADC_O_RESULT9    0x24U // 0x9U    // ADC Result 9 Register
#define ADC_O_RESULT10   0x28U // 0xAU    // ADC Result 10 Register
#define ADC_O_RESULT11   0x2cU // 0xBU    // ADC Result 11 Register
#define ADC_O_RESULT12   0x30U // 0xCU    // ADC Result 12 Register
#define ADC_O_RESULT13   0x34U // 0xDU    // ADC Result 13 Register
#define ADC_O_RESULT14   0x38U // 0xEU    // ADC Result 14 Register
#define ADC_O_RESULT15   0x3cU // 0xFU    // ADC Result 15 Register
#define ADC_O_PPB1RESULT 0x40U // 0x10U   // ADC Post Processing Block 1 Result Register
#define ADC_O_PPB2RESULT 0x44U // 0x12U   // ADC Post Processing Block 2 Result Register
#define ADC_O_PPB3RESULT 0x48U // 0x14U   // ADC Post Processing Block 3 Result Register
#define ADC_O_PPB4RESULT 0x4cU // 0x16U   // ADC Post Processing Block 4 Result Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCTL1 register
//
//*************************************************************************************************
#define ADC_CTL1_INTPULSEPOS 0x4U  // ADC Interrupt Pulse Position
#define ADC_CTL1_ADCPWDNZ    0x80U // ADC Power Down
#define ADC_CTL1_ADCBSYCHN_S 8U
#define ADC_CTL1_ADCBSYCHN_M 0xF00U  // ADC Busy Channel
#define ADC_CTL1_ADCBSY      0x2000U // ADC Busy

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCTL2 register
//
//*************************************************************************************************
#define ADC_CTL2_PRESCALE_S 0U
#define ADC_CTL2_PRESCALE_M 0x1FU // ADC Clock Prescaler

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCBURSTCTL register
//
//*************************************************************************************************
#define ADC_BURSTCTL_BURSTTRIGSEL_S 0U
#define ADC_BURSTCTL_BURSTTRIGSEL_M 0x7FU // SOC Burst Trigger Source Select
#define ADC_BURSTCTL_BURSTSIZE_S    8U
#define ADC_BURSTCTL_BURSTSIZE_M    0xF00U  // SOC Burst Size Select
#define ADC_BURSTCTL_BURSTEN        0x8000U // SOC Burst Mode Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTFLG register
//
//*************************************************************************************************
#define ADC_INTFLG_ADCINT1 0x1U // ADC Interrupt 1 Flag
#define ADC_INTFLG_ADCINT2 0x2U // ADC Interrupt 2 Flag
#define ADC_INTFLG_ADCINT3 0x4U // ADC Interrupt 3 Flag
#define ADC_INTFLG_ADCINT4 0x8U // ADC Interrupt 4 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTFLGCLR register
//
//*************************************************************************************************
#define ADC_INTFLGCLR_ADCINT1 0x1U // ADC Interrupt 1 Flag Clear
#define ADC_INTFLGCLR_ADCINT2 0x2U // ADC Interrupt 2 Flag Clear
#define ADC_INTFLGCLR_ADCINT3 0x4U // ADC Interrupt 3 Flag Clear
#define ADC_INTFLGCLR_ADCINT4 0x8U // ADC Interrupt 4 Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTOVF register
//
//*************************************************************************************************
#define ADC_INTOVF_ADCINT1 0x1U // ADC Interrupt 1 Overflow Flags
#define ADC_INTOVF_ADCINT2 0x2U // ADC Interrupt 2 Overflow Flags
#define ADC_INTOVF_ADCINT3 0x4U // ADC Interrupt 3 Overflow Flags
#define ADC_INTOVF_ADCINT4 0x8U // ADC Interrupt 4 Overflow Flags

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTOVFCLR register
//
//*************************************************************************************************
#define ADC_INTOVFCLR_ADCINT1 0x1U // ADC Interrupt 1 Overflow Clear Bits
#define ADC_INTOVFCLR_ADCINT2 0x2U // ADC Interrupt 2 Overflow Clear Bits
#define ADC_INTOVFCLR_ADCINT3 0x4U // ADC Interrupt 3 Overflow Clear Bits
#define ADC_INTOVFCLR_ADCINT4 0x8U // ADC Interrupt 4 Overflow Clear Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTSEL1N2 register
//
//*************************************************************************************************
#define ADC_INTSEL1N2_INT1SEL_S 0U
#define ADC_INTSEL1N2_INT1SEL_M 0x1FU // ADCINT1 EOC Source Select
#define ADC_INTSEL1N2_INT1E     0x20U // ADCINT1 Interrupt Enable
#define ADC_INTSEL1N2_INT1CONT  0x40U // ADCINT1 Continue to Interrupt Mode
#define ADC_INTSEL1N2_INT2SEL_S 8U
#define ADC_INTSEL1N2_INT2SEL_M 0x1F00U // ADCINT2 EOC Source Select
#define ADC_INTSEL1N2_INT2E     0x2000U // ADCINT2 Interrupt Enable
#define ADC_INTSEL1N2_INT2CONT  0x4000U // ADCINT2 Continue to Interrupt Mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTSEL3N4 register
//
//*************************************************************************************************
#define ADC_INTSEL3N4_INT3SEL_S 0U
#define ADC_INTSEL3N4_INT3SEL_M 0x1FU // ADCINT3 EOC Source Select
#define ADC_INTSEL3N4_INT3E     0x20U // ADCINT3 Interrupt Enable
#define ADC_INTSEL3N4_INT3CONT  0x40U // ADCINT3 Continue to Interrupt Mode
#define ADC_INTSEL3N4_INT4SEL_S 8U
#define ADC_INTSEL3N4_INT4SEL_M 0x1F00U // ADCINT4 EOC Source Select
#define ADC_INTSEL3N4_INT4E     0x2000U // ADCINT4 Interrupt Enable
#define ADC_INTSEL3N4_INT4CONT  0x4000U // ADCINT4 Continue to Interrupt Mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCPRICTL register
//
//*************************************************************************************************
#define ADC_SOCPRICTL_SOCPRIORITY_S 0U
#define ADC_SOCPRICTL_SOCPRIORITY_M 0x1FU // SOC Priority
#define ADC_SOCPRICTL_RRPOINTER_S   5U
#define ADC_SOCPRICTL_RRPOINTER_M   0x3E0U // Round Robin Pointer

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTSOCSEL1 register
//
//*************************************************************************************************
#define ADC_INTSOCSEL1_SOC0_S 0U
#define ADC_INTSOCSEL1_SOC0_M 0x3U // SOC0 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC1_S 2U
#define ADC_INTSOCSEL1_SOC1_M 0xCU // SOC1 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC2_S 4U
#define ADC_INTSOCSEL1_SOC2_M 0x30U // SOC2 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC3_S 6U
#define ADC_INTSOCSEL1_SOC3_M 0xC0U // SOC3 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC4_S 8U
#define ADC_INTSOCSEL1_SOC4_M 0x300U // SOC4 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC5_S 10U
#define ADC_INTSOCSEL1_SOC5_M 0xC00U // SOC5 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC6_S 12U
#define ADC_INTSOCSEL1_SOC6_M 0x3000U // SOC6 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC7_S 14U
#define ADC_INTSOCSEL1_SOC7_M 0xC000U // SOC7 ADC Interrupt Trigger Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTSOCSEL2 register
//
//*************************************************************************************************
#define ADC_INTSOCSEL2_SOC8_S  0U
#define ADC_INTSOCSEL2_SOC8_M  0x3U // SOC8 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC9_S  2U
#define ADC_INTSOCSEL2_SOC9_M  0xCU // SOC9 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC10_S 4U
#define ADC_INTSOCSEL2_SOC10_M 0x30U // SOC10 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC11_S 6U
#define ADC_INTSOCSEL2_SOC11_M 0xC0U // SOC11 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC12_S 8U
#define ADC_INTSOCSEL2_SOC12_M 0x300U // SOC12 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC13_S 10U
#define ADC_INTSOCSEL2_SOC13_M 0xC00U // SOC13 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC14_S 12U
#define ADC_INTSOCSEL2_SOC14_M 0x3000U // SOC14 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC15_S 14U
#define ADC_INTSOCSEL2_SOC15_M 0xC000U // SOC15 ADC Interrupt Trigger Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCFLG1 register
//
//*************************************************************************************************
#define ADC_SOCFLG1_SOC0  0x1U    // SOC0 Start of Conversion Flag
#define ADC_SOCFLG1_SOC1  0x2U    // SOC1 Start of Conversion Flag
#define ADC_SOCFLG1_SOC2  0x4U    // SOC2 Start of Conversion Flag
#define ADC_SOCFLG1_SOC3  0x8U    // SOC3 Start of Conversion Flag
#define ADC_SOCFLG1_SOC4  0x10U   // SOC4 Start of Conversion Flag
#define ADC_SOCFLG1_SOC5  0x20U   // SOC5 Start of Conversion Flag
#define ADC_SOCFLG1_SOC6  0x40U   // SOC6 Start of Conversion Flag
#define ADC_SOCFLG1_SOC7  0x80U   // SOC7 Start of Conversion Flag
#define ADC_SOCFLG1_SOC8  0x100U  // SOC8 Start of Conversion Flag
#define ADC_SOCFLG1_SOC9  0x200U  // SOC9 Start of Conversion Flag
#define ADC_SOCFLG1_SOC10 0x400U  // SOC10 Start of Conversion Flag
#define ADC_SOCFLG1_SOC11 0x800U  // SOC11 Start of Conversion Flag
#define ADC_SOCFLG1_SOC12 0x1000U // SOC12 Start of Conversion Flag
#define ADC_SOCFLG1_SOC13 0x2000U // SOC13 Start of Conversion Flag
#define ADC_SOCFLG1_SOC14 0x4000U // SOC14 Start of Conversion Flag
#define ADC_SOCFLG1_SOC15 0x8000U // SOC15 Start of Conversion Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCFRC1 register
//
//*************************************************************************************************
#define ADC_SOCFRC1_SOC0  0x1U    // SOC0 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC1  0x2U    // SOC1 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC2  0x4U    // SOC2 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC3  0x8U    // SOC3 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC4  0x10U   // SOC4 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC5  0x20U   // SOC5 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC6  0x40U   // SOC6 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC7  0x80U   // SOC7 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC8  0x100U  // SOC8 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC9  0x200U  // SOC9 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC10 0x400U  // SOC10 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC11 0x800U  // SOC11 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC12 0x1000U // SOC12 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC13 0x2000U // SOC13 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC14 0x4000U // SOC14 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC15 0x8000U // SOC15 Force Start of Conversion Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCOVF1 register
//
//*************************************************************************************************
#define ADC_SOCOVF1_SOC0  0x1U    // SOC0 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC1  0x2U    // SOC1 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC2  0x4U    // SOC2 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC3  0x8U    // SOC3 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC4  0x10U   // SOC4 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC5  0x20U   // SOC5 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC6  0x40U   // SOC6 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC7  0x80U   // SOC7 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC8  0x100U  // SOC8 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC9  0x200U  // SOC9 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC10 0x400U  // SOC10 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC11 0x800U  // SOC11 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC12 0x1000U // SOC12 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC13 0x2000U // SOC13 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC14 0x4000U // SOC14 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC15 0x8000U // SOC15 Start of Conversion Overflow Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCOVFCLR1 register
//
//*************************************************************************************************
#define ADC_SOCOVFCLR1_SOC0  0x1U    // SOC0 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC1  0x2U    // SOC1 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC2  0x4U    // SOC2 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC3  0x8U    // SOC3 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC4  0x10U   // SOC4 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC5  0x20U   // SOC5 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC6  0x40U   // SOC6 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC7  0x80U   // SOC7 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC8  0x100U  // SOC8 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC9  0x200U  // SOC9 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC10 0x400U  // SOC10 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC11 0x800U  // SOC11 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC12 0x1000U // SOC12 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC13 0x2000U // SOC13 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC14 0x4000U // SOC14 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC15 0x8000U // SOC15 Clear Start of Conversion Overflow Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC0CTL register
//
//*************************************************************************************************
#define ADC_SOC0CTL_ACQPS_S   0U
#define ADC_SOC0CTL_ACQPS_M   0x1FFU // SOC0 Acquisition Prescale
#define ADC_SOC0CTL_CHSEL_S   15U
#define ADC_SOC0CTL_CHSEL_M   0xF8000U // SOC0 Channel Select
#define ADC_SOC0CTL_TRIGSEL_S 20U
#define ADC_SOC0CTL_TRIGSEL_M 0x7F00000U // SOC0 Trigger Source Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC1CTL register
//
//*************************************************************************************************
#define ADC_SOC1CTL_ACQPS_S   0U
#define ADC_SOC1CTL_ACQPS_M   0x1FFU // SOC1 Acquisition Prescale
#define ADC_SOC1CTL_CHSEL_S   15U
#define ADC_SOC1CTL_CHSEL_M   0xF8000U // SOC1 Channel Select
#define ADC_SOC1CTL_TRIGSEL_S 20U
#define ADC_SOC1CTL_TRIGSEL_M 0x7F00000U // SOC1 Trigger Source Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC2CTL register
//
//*************************************************************************************************
#define ADC_SOC2CTL_ACQPS_S   0U
#define ADC_SOC2CTL_ACQPS_M   0x1FFU // SOC2 Acquisition Prescale
#define ADC_SOC2CTL_CHSEL_S   15U
#define ADC_SOC2CTL_CHSEL_M   0xF8000U // SOC2 Channel Select
#define ADC_SOC2CTL_TRIGSEL_S 20U
#define ADC_SOC2CTL_TRIGSEL_M 0x7F00000U // SOC2 Trigger Source Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC3CTL register
//
//*************************************************************************************************
#define ADC_SOC3CTL_ACQPS_S   0U
#define ADC_SOC3CTL_ACQPS_M   0x1FFU // SOC3 Acquisition Prescale
#define ADC_SOC3CTL_CHSEL_S   15U
#define ADC_SOC3CTL_CHSEL_M   0xF8000U // SOC3 Channel Select
#define ADC_SOC3CTL_TRIGSEL_S 20U
#define ADC_SOC3CTL_TRIGSEL_M 0x7F00000U // SOC3 Trigger Source Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC4CTL register
//
//*************************************************************************************************
#define ADC_SOC4CTL_ACQPS_S   0U
#define ADC_SOC4CTL_ACQPS_M   0x1FFU // SOC4 Acquisition Prescale
#define ADC_SOC4CTL_CHSEL_S   15U
#define ADC_SOC4CTL_CHSEL_M   0xF8000U // SOC4 Channel Select
#define ADC_SOC4CTL_TRIGSEL_S 20U
#define ADC_SOC4CTL_TRIGSEL_M 0x7F00000U // SOC4 Trigger Source Select

