QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_adc.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1RESULT register
//
//*************************************************************************************************
#define ADC_PPB1RESULT_PPBRESULT_S 0U
#define ADC_PPB1RESULT_PPBRESULT_M 0x1FFFU // ADC Post Processing Block Result
#define ADC_PPB1RESULT_SIGN_S      13U
#define ADC_PPB1RESULT_SIGN_M      0xFFFFe000U // Sign Extended Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2RESULT register
//
//*************************************************************************************************
#define ADC_PPB2RESULT_PPBRESULT_S 0U
#define ADC_PPB2RESULT_PPBRESULT_M 0x1FFFU // ADC Post Processing Block Result
#define ADC_PPB2RESULT_SIGN_S      13U
#define ADC_PPB2RESULT_SIGN_M      0xFFFFe000U // Sign Extended Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3RESULT register
//
//*************************************************************************************************
#define ADC_PPB3RESULT_PPBRESULT_S 0U
#define ADC_PPB3RESULT_PPBRESULT_M 0x1FFFU // ADC Post Processing Block Result
#define ADC_PPB3RESULT_SIGN_S      13U
#define ADC_PPB3RESULT_SIGN_M      0xFFFFe000U // Sign Extended Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4RESULT register
//
//*************************************************************************************************
#define ADC_PPB4RESULT_PPBRESULT_S 0U
#define ADC_PPB4RESULT_PPBRESULT_M 0x1FFFU // ADC Post Processing Block Result
#define ADC_PPB4RESULT_SIGN_S      13U
#define ADC_PPB4RESULT_SIGN_M      0xFFFFe000U // Sign Extended Bits

#endif
